<?php

use Illuminate\Database\Seeder;

class CategoriesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $categories = [
            ['name' => ''],
            ['name' => 'عمومی'],
            ['name' => 'پزشکی'],
            ['name' => 'زیست‌شناسی و علوم آزمایشگاهی'],
            ['name' => 'علم شیمی'],
            ['name' => 'مالی - حسابداری'],
            ['name' => 'معارف اسلامی و الهیات'],
            ['name' => 'حقوق'],
            ['name' => 'مدیریت'],
            ['name' => 'مهندسی مکانیک'],
            ['name' => 'مهندسی عمران'],
            ['name' => 'مهندسی معماری'],
            ['name' => 'مهندسی کامپیوتر'],
            ['name' => 'مجموعه مهندسی برق'],
            ['name' => 'قرارداد و اسناد تجاری'],
            ['name' => 'روانشناسی'],
            ['name' => 'ادبیات و زبان شناسی'],
            ['name' => 'مواد و متالوژی'],
            ['name' => 'علم فیزیک'],
            ['name' => 'مجموعه ریاضیات و آمار'],
            ['name' => 'گردشگری'],
            ['name' => 'کشاورزی'],
            ['name' => 'اقتصاد'],
            ['name' => 'تاریخ'],
            ['name' => 'خبر'],
            ['name' => 'رزومه و انگیزه نامه'],
            ['name' => 'داستان و رمان'],
            ['name' => 'زمین شناسی و معدن'],
            ['name' => 'سیاسی و روابط بین الملل'],
            ['name' => 'صنایع غذایی'],
            ['name' => 'جامعه شناسی و علوم اجتماعی'],
            ['name' => 'فلسفه'],
            ['name' => 'اینترنت و تکنولوژی'],
            ['name' => 'محیط زیست و منابع طبیعی'],
            ['name' => 'مهندسی پزشکی'],
            ['name' => 'نظامی'],
            ['name' => 'نفت، گاز و پتروشیمی'],
            ['name' => 'ورزشی'],
            ['name' => 'هوافضا'],
            ['name' => 'مهندسی صنایع'],
            ['name' => 'هنر'],
        ];

        DB::table('categories')->insert($categories);
    }
}
